---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber
source: html/8bb4b3f7-9053-c9cb-751a-98803e7828eb.htm
---
# Autodesk.Revit.DB.FormattedText.GetMaximumListStartNumber Method

Returns the maximum allowed list start number.

## Syntax (C#)
```csharp
public int GetMaximumListStartNumber()
```